app/views/bookings/new.html.erb


  <% @book.room.bookings.each do |sd|%>
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = $1  [["room_id", 1]]