app/views/bookings/paytm_payment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]
---
        <div class="panel panel-info panel-heading"><center>Room Details </center></div>
          <h4>Invoice has sent to your mail(<%= User.find(@booking["user_id"]).email %>)</h4><br/>
          <strong>Room Address :</strong><br/><br/>
          <%= Room.find(@booking["room_id"]).address%>