app/views/rooms/_all_rooms.html.erb

SELECT "states".* FROM "states"
---
        <option value="#">State</option>
        <%State.all.each do |state|%>

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 2]]
---
                  <a href="#"><%= room.name%></a>
                    <br /> <a class="small"><%= City.find(room.city_id).name%></a>

SELECT "special_prices".* FROM "special_prices" WHERE "special_prices"."room_id" = $1  [["room_id", 43]]
---
                <ul class="card-info d-flex justify-content-around">
                  <% if room.special_prices.present? %>