app/views/rooms/_book_room.html.erb

			            <% if user_signed_in? && current_user.role.name == "admin" %>
			              <%= f.collection_select :user_id, User.all, :id, :username %>
---
SELECT "users".* FROM "users"