app/views/rooms/_form.html.erb

        <div class="col-lg-4 col-md-4 col-sm-4 col-xs-4 ">
          <%= f.collection_select :state_id, State.all, :id , :name, {}, class: "form-control input-sm"%>
---
SELECT "states".* FROM "states"

          <div class="checkbox">
            <%= f.collection_check_boxes :amenity_ids, Amenity.all, :id, :name do |course|%>
---
SELECT "amenities".* FROM "amenities"