app/views/rooms/_form.html.erb

SELECT "cities".* FROM "cities"
---
        <%= f.label :city %><br>
        <%= f.collection_select :city_id, City.all, :id, :name, {prompt: "Select City"}, {class: "form-control"} %>