app/views/rooms/_review.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 2]]
---

            <% if user_signed_in?&&current_user.bookings.any? %>