app/views/rooms/index.html.erb

        <option value="#">State</option>
        <%State.all.each do |state|%>
---
SELECT "states".* FROM "states"


    $('.state').on('change', function(){
      var state = $('.state').val()
      $.ajax({
        url: "/get_all_cities?state=" + state,
        method: "GET",
        success: function(data){
          document.getElementById('city').options.length = 0;
          data.forEach(function(city){
            var option = document.createElement('option');
            var optValue = document.createAttribute('value');
            optValue.value = city.id
            option.setAttributeNode(optValue);
            var txt = document.createTextNode(city.name);
            option.appendChild(txt);
            document.getElementById("city").appendChild(option)
          })
        },
        error: function(data){
          console.log(data)
        }
      })
---
SELECT "cities".* FROM "cities"