app/views/rooms/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."room_id" = $1  [["room_id", 1]]
---
              <label style="float : right">Rating : <%total_rating = 0%>
            <% if !room.reviews.present?%>