app/views/rooms/show.html.erb

SELECT  1 AS one FROM "special_prices" WHERE "special_prices"."room_id" = $1 LIMIT 1  [["room_id", 1]]
SELECT "special_prices".* FROM "special_prices" WHERE "special_prices"."room_id" = $1  [["room_id", 1]]
---
      <div id="menu1" class="tab-pane fade"><br/>
        <% if @room.special_prices.empty? %>

SELECT "amenities".* FROM "amenities" INNER JOIN "amenity_rooms" ON "amenities"."id" = "amenity_rooms"."amenity_id" WHERE "amenity_rooms"."room_id" = $1  [["room_id", 1]]
---
        <ol>
          <% @room.amenities.each do |amenity| %>

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]
---
        <% if user_signed_in?%>
          <%current_user.bookings.each do |booking|%>