app/controllers/amenities_controller.rb

  def index
    @amenities = Amenity.all
    @amenities = Amenity.paginate(:page => params[:page])
---
SELECT  "amenities".* FROM "amenities" LIMIT 5 OFFSET 0

  def create
    @amenity = Amenity.new(amenity_params)

    respond_to do |format|
      if @amenity.save
---
INSERT INTO "amenities" ("name", "description", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"