app/controllers/bookings_controller.rb

  def create
    @book = Booking.new(booking_params)

    if current_user.role.name != "admin"
      @book.user_id = current_user.id
    end

    if @book.save
      pdf = Prawn::Document.new
      pdf.move_cursor_to 700
      pdf.text @book.room.address, :size => 10, :color => "0000FE"
      pdf.bounding_box([380,700], :width => 150, :height => 100) do
        pdf.text "RENT SLIP", :size => 12, :color => "0000FE"
      end
      image = @book.room.images

      pdf.image "app/assets/images/myhomemainpage.jpg", :at => [250,680]

      pdf.move_cursor_to 625
      time = Time.now
      pdf.bounding_box([0,650], :width => 200, :height => 200) do
        pdf.table([
            ["Date", time.day.to_s + "/" + time.month.to_s + "/" + time.year.to_s]
          ])
      end

      pdf.bounding_box([0, 600], :width => 200, :height => 200) do
        pdf.text "To", :size => 14
        pdf.text @book.user.first_name.capitalize + " " +  @book.user.last_name.capitalize
---
INSERT INTO "bookings" ("start_date", "end_date", "room_id", "user_id", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["start_date", "2019-06-27"], ["end_date", "2019-06-28"], ["room_id", 1], ["user_id", 2], ["price", 200], ["created_at", "2019-06-22 11:24:23.693793"], ["updated_at", "2019-06-22 11:24:23.693793"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = $1  [["room_id", 1]]

  def update
  	@booking = Booking.find(params[:id])
    #binding.pry
  	if @booking.update_attributes(booking_params)
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "bookings" SET "is_confirmed" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["is_confirmed", "t"], ["updated_at", "2019-06-22 11:44:00.655077"], ["id", 3]]

  def confirmation
  	#@b = Booking.where('is_confirmed = ?', false)
    @b = Booking.joins(:room).where('rooms.user_id = ? AND is_confirmed =?', current_user.id, false)
---
SELECT "bookings".* FROM "bookings" INNER JOIN "rooms" ON "rooms"."id" = "bookings"."room_id" WHERE (rooms.user_id = 2 AND is_confirmed ='f')