app/controllers/payments_controller.rb

  def paytm_request
    payment_environment = 'staging' #(params[:payment_environment] == 'production' ? :production : :staging)
    user = User.find(params["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]