app/controllers/rooms_controller.rb

  def index
    if params.present?
      if params['state_id'].present?
        @rooms = Room.where(state_id: params['state_id'])
      end
      if params['city_id'].present? and params['city_id'] != 'undefined'
        @rooms = @rooms.where(city_id: params['city_id'])
      end
      if params['type'].present?
        @rooms = @rooms.where(house_type: params['type'])
      end
      if params['plan'].present?
        @rooms = @rooms.where(house_plan: params['plan'])
      end
    else
      @rooms = Room.all
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."state_id" = $1  [["state_id", 17]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."state_id" = $1 AND "rooms"."city_id" = $2  [["state_id", 17], ["city_id", 363]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."state_id" = $1 AND "rooms"."city_id" = $2 AND "rooms"."house_type" = $3  [["state_id", 17], ["city_id", 362], ["house_type", "single_room"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."state_id" = $1 AND "rooms"."city_id" = $2 AND "rooms"."house_type" = $3 AND "rooms"."house_plan" = $4  [["state_id", 17], ["city_id", 362], ["house_type", "single_room"], ["house_plan", "lease"]]
SELECT "rooms".* FROM "rooms"

  def get_all_cities
    @cities = City.where(state_code: params['state'])
---
SELECT "cities".* FROM "cities" WHERE "cities"."state_code" = $1  [["state_code", "7"]]

  def find_by_cities
      if params[:city_ids] != ""
        @rooms = Room.where(city_id: params[:city_ids].split(","))
      else
         @rooms = Room.all
---
SELECT "rooms".* FROM "rooms" WHERE (is_authorized = 'f')

  def create
    @room = Room.new(room_params)
    @room.user_id = current_user.id
    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("name", "description", "price", "rules", "address", "images", "city_id", "state_id", "house_type", "house_plan", "user_id", "slug", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
    respond_to do |format|
      if @room.update(room_params)
---
UPDATE "rooms" SET "is_authorized" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["is_authorized", "t"], ["updated_at", "2019-06-22 10:45:50.326911"], ["id", 1]]